rasiharunart1/smartsocketlaravel/firmware/smart_socket_esp32/smart_socket_esp32.ino
/*
 * ============================================================================
 *  Smart Socket ESP32 Firmware
 *  ----------------------------------------------------------------------------
 *  Dual PZEM-004T v3.0 + 2-Channel Relay + DS18B20 + MQ-2 + LCD 16x2 I2C
 *  Target Hardware : ESP32 (Arduino Core 2.x & 3.x)
 *  Backend Platform: Laravel 13 (smartsocket) via HiveMQ Cloud MQTT (TLS 8883)
 *
 *  Pin Mapping:
 *    #define RELAY1_PIN   18   // Relay Soket 1 (Output)
 *    #define RELAY2_PIN   19   // Relay Soket 2 (Output)
 *    #define DS18B20_PIN  5    // Sensor Suhu Enclosure (OneWire)
 *    #define MQ2_PIN      34   // Sensor Gas & Asap Enclosure (ADC1 CH6)
 *    PZEM1 (RX 16, TX 17)      // PZEM-004T v3.0 Soket 1 (HardwareSerial 1)
 *    PZEM2 (RX 26, TX 27)      // PZEM-004T v3.0 Soket 2 (HardwareSerial 2)
 *    I2C LCD (SDA 21, SCL 22)  // LCD 16x2 I2C Address 0x27 / 0x3F
 * ============================================================================
 */

#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <PZEM004Tv30.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <Preferences.h>

// ----------------------------- VERSI FIRMWARE & IDENTITAS -----------------------------
#define FIRMWARE_VERSION "2.4.0"

// Identitas perangkat: Samakan dengan "Device UID" pada web menu Settings
#define DEVICE_UID "ESP32_SOCKET_01"

// ----------------------------- KONFIGURASI WIFI -----------------------------
// Masukkan SSID dan Password WiFi jaringan Anda di sini
const char* WIFI_SSID = "YOUR_WIFI_SSID";
const char* WIFI_PASS = "YOUR_WIFI_PASSWORD";

// ----------------------------- MQTT (HiveMQ Cloud TLS 8883) -----------------------------
const char* MQTT_HOST      = "ab11f67ab13c48b5937d15d0439112f4.s1.eu.hivemq.cloud";
const uint16_t MQTT_PORT   = 8883;
const char* MQTT_USER      = "wilda";
const char* MQTT_PASS      = "wildajuwita321";
const char* MQTT_CLIENT_ID = "ESP32_SmartSocket";

// ----------------------------- TOPIK MQTT DINAMIS -----------------------------
String TOPIC_TELEMETRY;   // smartsocket/{uid}/telemetry
String TOPIC_STATUS;      // smartsocket/{uid}/status
String TOPIC_ALERT;       // smartsocket/{uid}/alert
String TOPIC_SWITCH;      // smartsocket/{uid}/command/switch
String TOPIC_THRESHOLD;   // smartsocket/{uid}/command/threshold
String TOPIC_RECONNECT;   // smartsocket/{uid}/command/reconnect

// ----------------------------- PIN MAPPING -----------------------------
#define RELAY1_PIN   18   // Relay Soket 1
#define RELAY2_PIN   19   // Relay Soket 2

#define DS18B20_PIN  5    // Sensor Suhu Enclosure DS18B20 (OneWire)
#define MQ2_PIN      34   // Sensor Gas & Asap MQ-2 (Input Analog ADC1 CH6)

// PZEM 1 (Soket 1) -> HardwareSerial(1)
#define PZEM1_RX     16
#define PZEM1_TX     17
HardwareSerial PZEMSerial1(1);
PZEM004Tv30 pzem1(PZEMSerial1, PZEM1_RX, PZEM1_TX);

// PZEM 2 (Soket 2) -> HardwareSerial(2)
#define PZEM2_RX     26
#define PZEM2_TX     27
HardwareSerial PZEMSerial2(2);
PZEM004Tv30 pzem2(PZEMSerial2, PZEM2_RX, PZEM2_TX);

// OneWire & Dallas Temperature
OneWire oneWire(DS18B20_PIN);
DallasTemperature sensors(&oneWire);

// LCD 16x2 I2C
#define LCD_I2C_ADDR 0x27  // Alamat standar PCF8574 (0x27) atau PCF8574A (0x3F)
#define LCD_I2C_SDA  21
#define LCD_I2C_SCL  22
#define LCD_COLUMNS  16
#define LCD_ROWS     2
LiquidCrystal_I2C lcd(LCD_I2C_ADDR, LCD_COLUMNS, LCD_ROWS);

// Konfigurasi Level Logika Relay:
// Sebagian besar modul relay 2-channel optocoupler adalah ACTIVE-LOW (LOW = ON, HIGH = OFF).
// Jika modul relay Anda tipe ACTIVE-HIGH (HIGH = ON), ubah menjadi false.
#define RELAY_ACTIVE_LOW  true

// Custom Icon untuk LCD 16x2 (Karakter Derajat °)
const byte customCharDegree[8] = {
    0b00111,
    0b00101,
    0b00111,
    0b00000,
    0b00000,
    0b00000,
    0b00000,
    0b00000
};

// ----------------------------- WAKTU & INTERVAL (NON-BLOCKING) -----------------------------
#define SENSOR_READ_INTERVAL_MS 1000   // Pembacaan sensor & evaluasi keselamatan tiap 1 detik
#define TELEMETRY_INTERVAL_MS   5000   // Kirim telemetri ke server tiap 5 detik
#define STATUS_INTERVAL_MS      30000  // Kirim heartbeat online berkala tiap 30 detik
#define LCD_PAGE_INTERVAL_MS    2500   // Rotasi halaman info LCD tiap 2,5 detik
#define ALERT_COOLDOWN_MS       30000  // Batasi kirim alarm serupa maks 1x per 30 detik
#define WIFI_RETRY_INTERVAL_MS  10000  // Jeda rekoneksi WiFi jika terputus
#define MQTT_RECONNECT_MS       5000   // Jeda rekoneksi MQTT jika terputus

unsigned long lastSensorReadMs  = 0;
unsigned long lastTelemetryMs   = 0;
unsigned long lastStatusMs      = 0;
unsigned long lastLcdPageMs     = 0;
unsigned long lastWifiRetryMs   = 0;
unsigned long lastMqttRetryMs   = 0;
unsigned long lcdAlertUntilMs   = 0;
unsigned long lastAlertSentMs   = 0;
String        lastAlertSentType = "";
uint8_t       lcdPage           = 0;

// ----------------------------- ARDUINOJSON V6 & V7 MACRO -----------------------------
#if defined(ARDUINOJSON_VERSION_MAJOR) && (ARDUINOJSON_VERSION_MAJOR >= 7)
    #define ALLOC_JSON_DOC(doc, size) JsonDocument doc
#else
    #define ALLOC_JSON_DOC(doc, size) StaticJsonDocument<size> doc
#endif

// ----------------------------- STATUS RELAY & SENSOR -----------------------------
bool relay1State = false;  // false = OFF, true = ON
bool relay2State = false;

struct SensorSnapshot {
    float voltage1    = 0.0f;
    float current1    = 0.0f;
    float power1      = 0.0f;
    float energy1     = 0.0f;
    float freq1       = 0.0f;
    float pf1         = 0.0f;

    float voltage2    = 0.0f;
    float current2    = 0.0f;
    float power2      = 0.0f;
    float energy2     = 0.0f;
    float freq2       = 0.0f;
    float pf2         = 0.0f;

    float temperature = 0.0f;
    float smokePpm    = 0.0f;
    bool  isTripped   = false;
} latestSensor;

// ----------------------------- THRESHOLD -----------------------------
struct Thresholds {
    float max_voltage     = 245.0f; // Default 245V
    float max_current     = 15.5f;  // Default 15.5A
    float max_temperature = 65.0f;  // Default 65°C
    float max_smoke_ppm   = 995.0f; // Default 995 ppm
} thresholds;

// Objek Penyimpanan Flash Non-Volatile (NVS Preferences)
Preferences preferences;

// ----------------------------- OBJEK MQTT TLS -----------------------------
WiFiClientSecure wifiClient;
PubSubClient mqttClient(wifiClient);

// Helper pengatur relay dengan penanganan active-low aman
inline void setRelayOutput(int socket, bool state) {
    uint8_t pin = (socket == 1) ? RELAY1_PIN : RELAY2_PIN;
    bool pinLevel = RELAY_ACTIVE_LOW ? (!state) : state;
    digitalWrite(pin, pinLevel ? HIGH : LOW);
    if (socket == 1) relay1State = state;
    if (socket == 2) relay2State = state;
}

// Forward declarations
void printLcdLine(uint8_t row, const char* text);
void showLcdAlert(const char* type);
void updateLcd(unsigned long now);
void checkWifiAndMqtt(unsigned long now);
void connectMqtt();
void mqttCallback(char* topic, byte* payload, unsigned int length);
void processSwitchCommand(int socketNumber, const char* stateStr);
void processThresholdCommand(float v_max, float c_max, float t_max, float s_max);
void processReconnectCommand();
float readTemperature();
float readSmokePPM();
float sanitizeReading(float value);
void readAllSensors();
void publishTelemetry();
void evaluateThresholds();
void sendAlert(const char* type, float value, float threshold, const char* action, int socketNumber = 0);
String buildStatusPayload(bool online);
void publishStatus(bool online);
void loadSavedThresholds();
void saveThresholds();

// ============================================================================
//  SETUP
// ============================================================================
void setup() {
    Serial.begin(115200);
    delay(250);
    Serial.println("\n=======================================================");
    Serial.println("  Smart Socket ESP32 Firmware v" FIRMWARE_VERSION);
    Serial.println("=======================================================");

