rasiharunart1/smartsocketlaravel/firmware/smart_socket_esp32/smart_socket_esp32.ino
    // 1. Inisialisasi Pin Relay terlebih dahulu (Cegah glitch klik saat boot)
    digitalWrite(RELAY1_PIN, RELAY_ACTIVE_LOW ? HIGH : LOW);
    pinMode(RELAY1_PIN, OUTPUT);
    digitalWrite(RELAY2_PIN, RELAY_ACTIVE_LOW ? HIGH : LOW);
    pinMode(RELAY2_PIN, OUTPUT);
    relay1State = false;
    relay2State = false;

    // 2. Muat batas proteksi dari memori Flash (NVS)
    loadSavedThresholds();

    // 3. Konfigurasi ADC ESP32 untuk pembacaan analog akurat MQ-2
    analogReadResolution(12);
    analogSetPinAttenuation(MQ2_PIN, ADC_11db);

    // 4. Inisialisasi I2C Wire untuk LCD 16x2 dengan Timeout anti-lockup
    Wire.begin(LCD_I2C_SDA, LCD_I2C_SCL);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    Wire.setTimeout(100);
#else
    Wire.setTimeOut(100);
#endif
    Wire.setClock(100000); // 100 kHz standard mode

    lcd.init();
    lcd.backlight();
    lcd.createChar(1, (uint8_t*)customCharDegree);

    printLcdLine(0, " SMART SOCKET ");
    printLcdLine(1, " MEMULAI SISTEM");

    // 5. Build topik MQTT dinamis berbasis UID perangkat
    TOPIC_TELEMETRY = String("smartsocket/") + DEVICE_UID + "/telemetry";
    TOPIC_STATUS    = String("smartsocket/") + DEVICE_UID + "/status";
    TOPIC_ALERT     = String("smartsocket/") + DEVICE_UID + "/alert";
    TOPIC_SWITCH    = String("smartsocket/") + DEVICE_UID + "/command/switch";
    TOPIC_THRESHOLD = String("smartsocket/") + DEVICE_UID + "/command/threshold";
    TOPIC_RECONNECT = String("smartsocket/") + DEVICE_UID + "/command/reconnect";

    // 6. Inisialisasi HardwareSerial PZEM-004T v3.0
    PZEMSerial1.begin(9600, SERIAL_8N1, PZEM1_RX, PZEM1_TX);
    PZEMSerial2.begin(9600, SERIAL_8N1, PZEM2_RX, PZEM2_TX);

    // 7. Inisialisasi Sensor Suhu OneWire DS18B20 secara asinkron (non-blocking)
    sensors.begin();
    sensors.setWaitForConversion(false);
    sensors.requestTemperatures();

    // 8. Inisialisasi WiFi
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("[WiFi] Menghubungkan ke ");
    Serial.println(WIFI_SSID);
    printLcdLine(0, "WiFi");
    printLcdLine(1, "Menghubungkan...");

    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < 8000) {
        delay(250);
        Serial.print(".");
    }
    Serial.println();

    if (WiFi.status() == WL_CONNECTED) {
        Serial.print("[WiFi] Terhubung. IP: ");
        Serial.println(WiFi.localIP());
        printLcdLine(0, "WiFi Terhubung");
        printLcdLine(1, WiFi.localIP().toString().c_str());
        delay(600);
    } else {
        Serial.println("[WiFi] Belum terhubung. Melanjutkan dalam mode mandiri...");
        printLcdLine(0, "WiFi Belum Konek");
        printLcdLine(1, "Mode Mandiri");
        delay(600);
    }

    // 9. Konfigurasi MQTT TLS HiveMQ Cloud
    wifiClient.setInsecure(); // Mengabaikan validasi root CA untuk efisiensi RAM ESP32
    mqttClient.setServer(MQTT_HOST, MQTT_PORT);
    mqttClient.setBufferSize(1024); // Alokasi buffer paket MQTT aman untuk JSON
    mqttClient.setCallback(mqttCallback);
    mqttClient.setKeepAlive(30);

    Serial.println("[System] Setup selesai. Menjalankan pemantauan background...");
}

// ============================================================================
//  LOOP
// ============================================================================
void loop() {
    unsigned long now = millis();

    // 1. Pemeliharaan Koneksi WiFi & MQTT (Asinkron & Non-blocking)
    checkWifiAndMqtt(now);

    // 2. Pembacaan Sensor & Evaluasi Ambang Batas Keamanan (Setiap 1 detik)
    if (now - lastSensorReadMs >= SENSOR_READ_INTERVAL_MS) {
        lastSensorReadMs = now;
        readAllSensors();
        evaluateThresholds();
    }

    // 3. Publish Telemetri ke Backend Laravel (Setiap 5 detik)
    if (now - lastTelemetryMs >= TELEMETRY_INTERVAL_MS) {
        lastTelemetryMs = now;
        publishTelemetry();
    }

    // 4. Publish Heartbeat Status (Setiap 30 detik)
    if (now - lastStatusMs >= STATUS_INTERVAL_MS) {
        lastStatusMs = now;
        publishStatus(true);
    }

    // 5. Update Multi-Page Insight Layar LCD 16x2
    updateLcd(now);
}

// ============================================================================
//  PEMELIHARAAN KONEKSI (WIFI & MQTT NON-BLOCKING)
// ============================================================================
void checkWifiAndMqtt(unsigned long now) {
    // A. Periksa WiFi
    if (WiFi.status() != WL_CONNECTED) {
        if (now - lastWifiRetryMs >= WIFI_RETRY_INTERVAL_MS) {
            lastWifiRetryMs = now;
            Serial.println("[WiFi] Mencoba menghubungkan kembali ke jaringan...");
            WiFi.disconnect();
            WiFi.begin(WIFI_SSID, WIFI_PASS);
        }
        return; // Jangan coba MQTT jika WiFi belum tersambung
    }

    // B. Periksa MQTT
    if (!mqttClient.connected()) {
        if (now - lastMqttRetryMs >= MQTT_RECONNECT_MS) {
            lastMqttRetryMs = now;
            connectMqtt();
        }
    } else {
        mqttClient.loop();
    }
}

void connectMqtt() {
    // Generate Client ID unik berbasis MAC Address untuk mencegah disconnect collision di broker
    String uniqueClientId = String(MQTT_CLIENT_ID) + "_" + DEVICE_UID + "_" + String((uint32_t)ESP.getEfuseMac(), HEX);

    Serial.print("[MQTT] Menghubungkan ke ");
    Serial.print(MQTT_HOST);
    Serial.print(":");
    Serial.println(MQTT_PORT);

    // LWT: kirim "offline" jika perangkat putus koneksi secara tiba-tiba
    String lwtPayload = String("{\"device_id\":\"") + DEVICE_UID + "\",\"status\":\"offline\"}";
    String statusPayload = buildStatusPayload(true);

    if (mqttClient.connect(uniqueClientId.c_str(), MQTT_USER, MQTT_PASS,
                           TOPIC_STATUS.c_str(), 1, true, lwtPayload.c_str())) {
        Serial.println("[MQTT] Berhasil Terhubung ke HiveMQ Cloud Broker.");
        printLcdLine(0, "MQTT Terhubung");
        printLcdLine(1, "Sinkronisasi...");

        // Subscribe perintah dari backend Laravel
        mqttClient.subscribe(TOPIC_SWITCH.c_str(), 1);
        mqttClient.subscribe(TOPIC_THRESHOLD.c_str(), 1);
        mqttClient.subscribe(TOPIC_RECONNECT.c_str(), 1);

