rasiharunart1/smartsocketlaravel/firmware/smart_socket_esp32/smart_socket_esp32.ino
        // Publish status online dengan retain flag
        mqttClient.publish(TOPIC_STATUS.c_str(), statusPayload.c_str(), true);
    } else {
        Serial.print("[MQTT] Gagal terhubung. Kode Error=");
        Serial.println(mqttClient.state());
        char mqttError[17];
        snprintf(mqttError, sizeof(mqttError), "MQTT Err: %d", mqttClient.state());
        printLcdLine(0, "MQTT Putus");
        printLcdLine(1, mqttError);
    }
}

// ============================================================================
//  PENYIMPANAN FLASH NON-VOLATILE (NVS PREFERENCES)
// ============================================================================
void loadSavedThresholds() {
    preferences.begin("smartsocket", false);
    thresholds.max_voltage     = preferences.getFloat("v_max", 245.0f);
    thresholds.max_current     = preferences.getFloat("c_max", 15.5f);
    thresholds.max_temperature = preferences.getFloat("t_max", 65.0f);
    thresholds.max_smoke_ppm   = preferences.getFloat("s_max", 995.0f);
    preferences.end();

    // Validasi nilai dari flash jika sebelumnya kosong atau data acak
    if (isnan(thresholds.max_voltage) || thresholds.max_voltage <= 50.0f || thresholds.max_voltage > 300.0f) {
        thresholds.max_voltage = 245.0f;
    }
    if (isnan(thresholds.max_current) || thresholds.max_current <= 0.5f || thresholds.max_current > 100.0f) {
        thresholds.max_current = 15.5f;
    }
    if (isnan(thresholds.max_temperature) || thresholds.max_temperature <= 10.0f || thresholds.max_temperature > 120.0f) {
        thresholds.max_temperature = 65.0f;
    }
    if (isnan(thresholds.max_smoke_ppm) || thresholds.max_smoke_ppm <= 50.0f || thresholds.max_smoke_ppm > 5000.0f) {
        thresholds.max_smoke_ppm = 995.0f;
    }

    Serial.println("[NVS] Ambang batas keamanan berhasil dimuat dari Flash:");
    Serial.printf("  Voltage=%.1fV, Current=%.1fA, Temp=%.1fC, Smoke=%.0f ppm\n",
                  thresholds.max_voltage, thresholds.max_current,
                  thresholds.max_temperature, thresholds.max_smoke_ppm);
}

void saveThresholds() {
    preferences.begin("smartsocket", false);
    preferences.putFloat("v_max", thresholds.max_voltage);
    preferences.putFloat("c_max", thresholds.max_current);
    preferences.putFloat("t_max", thresholds.max_temperature);
    preferences.putFloat("s_max", thresholds.max_smoke_ppm);
    preferences.end();
    Serial.println("[NVS] Ambang batas keamanan berhasil disimpan ke Flash!");
}

// ============================================================================
//  LCD 16x2 I2C MULTI-PAGE INSIGHT VIEW
// ============================================================================
void printLcdLine(uint8_t row, const char* text) {
    char padded[LCD_COLUMNS + 1];
    snprintf(padded, sizeof(padded), "%-16.16s", text);
    lcd.setCursor(0, row);
    lcd.print(padded);
}

void showLcdAlert(const char* type) {
    lcd.clear();
    printLcdLine(0, "! ALARM TRIP !");
    if (strcmp(type, "OVER_CURRENT") == 0) {
        printLcdLine(1, "OVERLOAD BEBAN");
    } else if (strcmp(type, "OVER_VOLTAGE") == 0) {
        printLcdLine(1, "TEGANGAN TINGGI");
    } else if (strcmp(type, "OVER_TEMPERATURE") == 0) {
        printLcdLine(1, "SUHU TINGGI BOX");
    } else if (strcmp(type, "SMOKE_DETECTED") == 0) {
        printLcdLine(1, "BAHAYA ASAP MQ2");
    } else if (strcmp(type, "TRIP LOCKOUT") == 0) {
        printLcdLine(1, "KUNCI TRIP AKTIF");
    } else {
        printLcdLine(1, type);
    }
    lcdAlertUntilMs = millis() + 4500; // Tahan tampilan darurat selama 4,5 detik
}

void updateLcd(unsigned long now) {
    // Jika sedang dalam masa penahanan alert darurat, jangan ubah tampilan
    if (now < lcdAlertUntilMs) {
        return;
    }

    // Rotasi halaman sesuai interval (2,5 detik per halaman)
    if (now - lastLcdPageMs < LCD_PAGE_INTERVAL_MS) {
        return;
    }

    lastLcdPageMs = now;
    char line1[LCD_COLUMNS + 1];
    char line2[LCD_COLUMNS + 1];

    switch (lcdPage) {
        case 0: // INSIGHT 1: Status Jaringan & Broker MQTT
            snprintf(line1, sizeof(line1), "WiFi:%-3s RSSI:%3d",
                     WiFi.status() == WL_CONNECTED ? "OK" : "OFF",
                     WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0);
            snprintf(line2, sizeof(line2), "MQTT:%-11s",
                     mqttClient.connected() ? "TERHUBUNG" : "OFFLINE");
            break;

        case 1: // INSIGHT 2: Realtime Soket 1 (Relay, V, I, P)
            snprintf(line1, sizeof(line1), "S1[%-3s] %5.1fV",
                     relay1State ? "ON " : "OFF", latestSensor.voltage1);
            snprintf(line2, sizeof(line2), "%4.2fA %5.1fW",
                     latestSensor.current1, latestSensor.power1);
            break;

        case 2: // INSIGHT 3: Realtime Soket 2 (Relay, V, I, P)
            snprintf(line1, sizeof(line1), "S2[%-3s] %5.1fV",
                     relay2State ? "ON " : "OFF", latestSensor.voltage2);
            snprintf(line2, sizeof(line2), "%4.2fA %5.1fW",
                     latestSensor.current2, latestSensor.power2);
            break;

        case 3: // INSIGHT 4: Total Beban Daya & Akumulasi Energi
            snprintf(line1, sizeof(line1), "TOT P:%6.1f W",
                     latestSensor.power1 + latestSensor.power2);
            snprintf(line2, sizeof(line2), "TOT E:%6.3fkWh",
                     latestSensor.energy1 + latestSensor.energy2);
            break;

        case 4: // INSIGHT 5: Kualitas Daya Listrik (Frekuensi & Faktor Daya)
            snprintf(line1, sizeof(line1), "FREQ: %4.1f Hz",
                     latestSensor.freq1 > 0 ? latestSensor.freq1 : (latestSensor.freq2 > 0 ? latestSensor.freq2 : 50.0f));
            snprintf(line2, sizeof(line2), "PF1:%.2f PF2:%.2f",
                     latestSensor.pf1, latestSensor.pf2);
            break;

        case 5: // INSIGHT 6: Keselamatan Enclosure (Suhu DS18B20 & Asap MQ-2)
            snprintf(line1, sizeof(line1), "SUHU: %4.1f%cC",
                     latestSensor.temperature, '\x01');
            snprintf(line2, sizeof(line2), "ASAP: %4.0f PPM",
                     latestSensor.smokePpm);
            break;

