rasiharunart1/smartsocketlaravel/firmware/smart_socket_esp32/smart_socket_esp32.ino
        case 6: // INSIGHT 7: Status Proteksi & Saklar Sistem
            snprintf(line1, sizeof(line1), "PROTEKSI:%-7s",
                     latestSensor.isTripped ? "TRIP!" : "NORMAL");
            snprintf(line2, sizeof(line2), "R1:%-3s | R2:%-3s",
                     relay1State ? "ON" : "OFF",
                     relay2State ? "ON" : "OFF");
            break;

        default:
            lcdPage = 0;
            return;
    }

    printLcdLine(0, line1);
    printLcdLine(1, line2);

    // Rotasi ke insight berikutnya (0 sampai 6)
    lcdPage = (lcdPage + 1) % 7;
}

// ============================================================================
//  CALLBACK & HANDLER PERINTAH MQTT
// ============================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
    String topicStr = String(topic);
    String payloadStr;
    payloadStr.reserve(length + 1);
    for (unsigned int i = 0; i < length; i++) {
        payloadStr += (char)payload[i];
    }

    Serial.println("[MQTT] Pesan Masuk [" + topicStr + "]: " + payloadStr);

    ALLOC_JSON_DOC(doc, 512);
    DeserializationError err = deserializeJson(doc, payloadStr);
    if (err) {
        Serial.print("[MQTT] JSON parse gagal: ");
        Serial.println(err.c_str());
        return;
    }

    if (topicStr == TOPIC_SWITCH) {
        int socketNumber = doc["socket_number"] | 0;
        const char* stateStr = doc["state"] | "OFF";
        processSwitchCommand(socketNumber, stateStr);
    } else if (topicStr == TOPIC_THRESHOLD) {
        processThresholdCommand(
            doc["max_voltage"]     | thresholds.max_voltage,
            doc["max_current"]     | thresholds.max_current,
            doc["max_temperature"] | thresholds.max_temperature,
            doc["max_smoke_ppm"]   | thresholds.max_smoke_ppm
        );
    } else if (topicStr == TOPIC_RECONNECT) {
        processReconnectCommand();
    }
}

void processSwitchCommand(int socketNumber, const char* stateStr) {
    String state = String(stateStr);
    state.toUpperCase();
    bool turnOn = (state == "ON");

    // Jika sistem masih dalam kondisi bahaya aktif (misal asap tinggi/overvoltage), tolak switch ON
    if (turnOn && latestSensor.isTripped) {
        Serial.println("[Relay] PERINGATAN: Perintah ON ditolak karena sistem proteksi sedang aktif!");
        showLcdAlert("TRIP LOCKOUT");
        publishTelemetry(); // Perbarui web agar toggle switch kembali sinkron ke OFF
        return;
    }

    if (socketNumber == 1) {
        setRelayOutput(1, turnOn);
        Serial.printf("[Relay] Socket 1 => %s\n", turnOn ? "ON" : "OFF");
    } else if (socketNumber == 2) {
        setRelayOutput(2, turnOn);
        Serial.printf("[Relay] Socket 2 => %s\n", turnOn ? "ON" : "OFF");
    }

    // Segera publish telemetri agar dashboard web update instan (< 100ms)
    publishTelemetry();
    updateLcd(millis());
}

void processThresholdCommand(float v_max, float c_max, float t_max, float s_max) {
    if (v_max > 0) thresholds.max_voltage = v_max;
    if (c_max > 0) thresholds.max_current = c_max;
    if (t_max > 0) thresholds.max_temperature = t_max;
    if (s_max > 0) thresholds.max_smoke_ppm = s_max;

    Serial.println("[Threshold] Nilai batas proteksi diperbarui dari web:");
    Serial.printf("  Voltage=%.1fV, Current=%.1fA, Temp=%.1fC, Smoke=%.0f ppm\n",
                  thresholds.max_voltage, thresholds.max_current,
                  thresholds.max_temperature, thresholds.max_smoke_ppm);

    saveThresholds();
}

void processReconnectCommand() {
    Serial.println("[WiFi] Perintah rekoneksi diterima dari dashboard.");
    publishStatus(false);
    WiFi.disconnect();
    lastWifiRetryMs = millis();
    WiFi.begin(WIFI_SSID, WIFI_PASS);
}

// ============================================================================
//  PEMBACAAN SENSOR (PZEM, DS18B20, MQ-2)
// ============================================================================
float readTemperature() {
    float t = sensors.getTempCByIndex(0);
    // Request konversi asinkron untuk pembacaan siklus berikutnya (0ms blocking)
    sensors.requestTemperatures();

    // Validasi nilai sensor DS18B20 (-127 = disconnected)
    if (t == DEVICE_DISCONNECTED_C || t < -55.0f || t > 125.0f || isnan(t)) {
        return 0.0f;
    }
    return t;
}

float readSmokePPM() {
    // Multi-sampling 10 kali untuk meredam noise ADC ESP32
    long sum = 0;
    for (int i = 0; i < 10; i++) {
        sum += analogRead(MQ2_PIN);
        delayMicroseconds(150);
    }
    float raw = (float)sum / 10.0f;

    // Kalibrasi standar MQ-2: Konversi 12-bit ADC (0-4095) ke 0-2000 ppm
    float ppm = (raw / 4095.0f) * 2000.0f;
    if (ppm < 0.0f) ppm = 0.0f;
    return ppm;
}

float sanitizeReading(float value) {
    return (isnan(value) || isinf(value) || value < 0.0f) ? 0.0f : value;
}

void readAllSensors() {
    // 1. Baca sensor PZEM 1 (Soket 1)
    // Optimasi: jika voltage gagal / 0, skip metrik lainnya agar tidak kena serial delay
    float v1 = sanitizeReading(pzem1.voltage());
    float c1 = 0, p1 = 0, e1 = 0, f1 = 0, pf1 = 0;
    if (v1 > 0) {
        c1 = sanitizeReading(pzem1.current());
        p1 = sanitizeReading(pzem1.power());
        e1 = sanitizeReading(pzem1.energy());
        f1 = sanitizeReading(pzem1.frequency());
        pf1 = sanitizeReading(pzem1.pf());
    }

    // 2. Baca sensor PZEM 2 (Soket 2)
    float v2 = sanitizeReading(pzem2.voltage());
    float c2 = 0, p2 = 0, e2 = 0, f2 = 0, pf2 = 0;
    if (v2 > 0) {
        c2 = sanitizeReading(pzem2.current());
        p2 = sanitizeReading(pzem2.power());
        e2 = sanitizeReading(pzem2.energy());
        f2 = sanitizeReading(pzem2.frequency());
        pf2 = sanitizeReading(pzem2.pf());
    }

    // 3. Suhu Enclosure DS18B20 & Asap MQ-2
    float temp  = readTemperature();
    float smoke = readSmokePPM();

    latestSensor.voltage1    = v1;
    latestSensor.current1    = c1;
    latestSensor.power1      = p1;
    latestSensor.energy1     = e1;
    latestSensor.freq1       = f1;
    latestSensor.pf1         = pf1;

    latestSensor.voltage2    = v2;
    latestSensor.current2    = c2;
    latestSensor.power2      = p2;
    latestSensor.energy2     = e2;
    latestSensor.freq2       = f2;
    latestSensor.pf2         = pf2;

    latestSensor.temperature = temp;
    latestSensor.smokePpm    = smoke;
}

// ============================================================================
//  PUBLISH TELEMETRI
// ============================================================================
void publishTelemetry() {
    // Buat payload JSON sesuai format baku backend Laravel (kompatibel ArduinoJson v6 & v7)
    ALLOC_JSON_DOC(doc, 1024);
    doc["device_id"] = DEVICE_UID;
    doc["timestamp"] = (uint32_t)(millis() / 1000);

    doc["environmental"]["temperature"] = latestSensor.temperature;
    doc["environmental"]["smoke_ppm"]    = latestSensor.smokePpm;

    doc["sockets"]["socket_1"]["relay_state"]  = relay1State ? "ON" : "OFF";
    doc["sockets"]["socket_1"]["voltage"]      = latestSensor.voltage1;
    doc["sockets"]["socket_1"]["current"]      = latestSensor.current1;
    doc["sockets"]["socket_1"]["power"]        = latestSensor.power1;
    doc["sockets"]["socket_1"]["energy"]       = latestSensor.energy1;
    doc["sockets"]["socket_1"]["frequency"]    = latestSensor.freq1;
    doc["sockets"]["socket_1"]["power_factor"] = latestSensor.pf1;

    doc["sockets"]["socket_2"]["relay_state"]  = relay2State ? "ON" : "OFF";
    doc["sockets"]["socket_2"]["voltage"]      = latestSensor.voltage2;
    doc["sockets"]["socket_2"]["current"]      = latestSensor.current2;
    doc["sockets"]["socket_2"]["power"]        = latestSensor.power2;
    doc["sockets"]["socket_2"]["energy"]       = latestSensor.energy2;
    doc["sockets"]["socket_2"]["frequency"]    = latestSensor.freq2;
    doc["sockets"]["socket_2"]["power_factor"] = latestSensor.pf2;

    char buffer[1024];
    serializeJson(doc, buffer);

    if (mqttClient.connected()) {
        // Publish telemetri TANPA retain flag
        mqttClient.publish(TOPIC_TELEMETRY.c_str(), buffer, false);
        Serial.print("[Telemetri] ");
        Serial.println(buffer);
    }
}

// ============================================================================
//  EVALUASI THRESHOLD & ALERT (DENGAN FLOOD PROTECTION & TRIP GRANULAR)
// ============================================================================
void evaluateThresholds() {
    float v1    = latestSensor.voltage1;
    float v2    = latestSensor.voltage2;
    float c1    = latestSensor.current1;
    float c2    = latestSensor.current2;
    float temp  = latestSensor.temperature;
    float smoke = latestSensor.smokePpm;

    unsigned long now = millis();
    bool canSendAlert = (now - lastAlertSentMs >= ALERT_COOLDOWN_MS);

