rasiharunart1/smartsocketlaravel/firmware/smart_socket_esp32/smart_socket_esp32.ino
    bool tripSocket1 = false;
    bool tripSocket2 = false;

    // 1. Over Voltage (Tegangan Berlebih PLN) -> Matikan kedua soket
    if (thresholds.max_voltage > 0) {
        if (v1 >= thresholds.max_voltage || v2 >= thresholds.max_voltage) {
            float worstV = (v1 >= thresholds.max_voltage) ? v1 : v2;
            int tripSocket = (v1 >= thresholds.max_voltage && v2 >= thresholds.max_voltage) ? 0 : ((v1 >= thresholds.max_voltage) ? 1 : 2);
            tripSocket1 = true;
            tripSocket2 = true;
            if (canSendAlert || lastAlertSentType != "OVER_VOLTAGE") {
                sendAlert("OVER_VOLTAGE", worstV, thresholds.max_voltage, "AUTO_CUTOFF_ALL", tripSocket);
                lastAlertSentMs = now;
                lastAlertSentType = "OVER_VOLTAGE";
            }
        }
    }

    // 2. Over Current (Arus Beban Berlebih) -> Matikan soket yang overload
    if (thresholds.max_current > 0) {
        if (c1 >= thresholds.max_current) {
            tripSocket1 = true;
            if (canSendAlert || lastAlertSentType != "OVER_CURRENT_1") {
                sendAlert("OVER_CURRENT", c1, thresholds.max_current, "AUTO_CUTOFF_SOCKET_1", 1);
                lastAlertSentMs = now;
                lastAlertSentType = "OVER_CURRENT_1";
            }
        }
        if (c2 >= thresholds.max_current) {
            tripSocket2 = true;
            if (canSendAlert || lastAlertSentType != "OVER_CURRENT_2") {
                sendAlert("OVER_CURRENT", c2, thresholds.max_current, "AUTO_CUTOFF_SOCKET_2", 2);
                lastAlertSentMs = now;
                lastAlertSentType = "OVER_CURRENT_2";
            }
        }
    }

    // 3. Smoke Detected (Asap / Gas MQ-2) -> Bahaya Kebakaran, Matikan SEMUA soket
    if (thresholds.max_smoke_ppm > 0 && smoke >= thresholds.max_smoke_ppm) {
        tripSocket1 = true;
        tripSocket2 = true;
        if (canSendAlert || lastAlertSentType != "SMOKE_DETECTED") {
            sendAlert("SMOKE_DETECTED", smoke, thresholds.max_smoke_ppm, "EMERGENCY_ALERT", 0);
            lastAlertSentMs = now;
            lastAlertSentType = "SMOKE_DETECTED";
        }
    }

    // 4. Over Temperature (Suhu Box Enclosure DS18B20)
    if (thresholds.max_temperature > 0 && temp >= thresholds.max_temperature) {
        if (temp >= thresholds.max_temperature + 10.0f) {
            tripSocket1 = true;
            tripSocket2 = true;
        }
        if (canSendAlert || lastAlertSentType != "OVER_TEMPERATURE") {
            sendAlert("OVER_TEMPERATURE", temp, thresholds.max_temperature, "WARNING_LOGGED", 0);
            lastAlertSentMs = now;
            lastAlertSentType = "OVER_TEMPERATURE";
        }
    }

    // Eksekusi pemutusan proteksi jika ada kondisi trip
    if (tripSocket1) {
        setRelayOutput(1, false);
    }
    if (tripSocket2) {
        setRelayOutput(2, false);
    }

    if (tripSocket1 || tripSocket2) {
        latestSensor.isTripped = true;
        Serial.println("[Safety] Trip proteksi terpicu! Relay dimatikan.");
        publishTelemetry();
    } else {
        // Reset trip lockout jika kondisi lingkungan telah normal
        if (latestSensor.isTripped && temp < thresholds.max_temperature && smoke < thresholds.max_smoke_ppm) {
            latestSensor.isTripped = false;
            lastAlertSentType = "";
        }
    }
}

void sendAlert(const char* type, float value, float threshold, const char* action, int socketNumber) {
    showLcdAlert(type);

    ALLOC_JSON_DOC(doc, 256);
    doc["device_id"]    = DEVICE_UID;
    doc["alert_type"]   = type;
    doc["value"]        = value;
    doc["threshold"]    = threshold;
    doc["action_taken"] = action;
    if (socketNumber > 0) {
        doc["socket_number"] = socketNumber;
    }
    doc["timestamp"]    = (uint32_t)(millis() / 1000);

    char buffer[256];
    serializeJson(doc, buffer);

    if (mqttClient.connected()) {
        // Publish alert tanpa retain flag agar tidak berulang saat subscriber baru join
        mqttClient.publish(TOPIC_ALERT.c_str(), buffer, false);
        Serial.print("[Alert] ");
        Serial.println(buffer);
    }
}

// ============================================================================
//  STATUS (LWT & HEARTBEAT)
// ============================================================================
String buildStatusPayload(bool online) {
    ALLOC_JSON_DOC(doc, 512);
    doc["device_id"]        = DEVICE_UID;
    doc["status"]           = online ? "online" : "offline";
    doc["ip_address"]       = WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "0.0.0.0";
    doc["mac_address"]      = WiFi.macAddress();
    doc["wifi_rssi"]        = WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0;
    doc["firmware_version"] = FIRMWARE_VERSION;
    doc["timestamp"]        = (uint32_t)(millis() / 1000);

    char buffer[512];
    serializeJson(doc, buffer);
    return String(buffer);
}

void publishStatus(bool online) {
    String payload = buildStatusPayload(online);
    if (mqttClient.connected()) {
        // Status dipublish DENGAN retain flag (QoS 1, retain: true)
        mqttClient.publish(TOPIC_STATUS.c_str(), payload.c_str(), true);
        Serial.print("[Status] ");
        Serial.println(payload);
    }
}
